tf_net
cifar_100_c
epochs=20
batchSize=100
dropRate=0.25
accuracy=30.090000%


Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            (None, 3072)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               1573376   
_________________________________________________________________
dense_1 (Dense)              (None, 20)                10260     
=================================================================
Total params: 1,583,636
Trainable params: 1,583,636
Non-trainable params: 0
_________________________________________________________________
