tf_conv
cifar_100_f
epochs=40
batchSize=100
dropRate=0.25
accuracy=47.090000%


Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
random_crop (RandomCrop)     (None, 24, 24, 3)         0
_________________________________________________________________
conv2d (Conv2D)              (None, 24, 24, 8)         104
_________________________________________________________________
batch_normalization (BatchNo (None, 24, 24, 8)         32
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 24, 24, 16)        528
_________________________________________________________________
batch_normalization_1 (Batch (None, 24, 24, 16)        64
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 24, 32)        4640
_________________________________________________________________
batch_normalization_2 (Batch (None, 24, 24, 32)        128
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 32)        0
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 64)        18496
_________________________________________________________________
batch_normalization_3 (Batch (None, 12, 12, 64)        256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 6, 64)          0
_________________________________________________________________
dropout_1 (Dropout)          (None, 6, 6, 64)          0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 6, 128)         73856
_________________________________________________________________
batch_normalization_4 (Batch (None, 6, 6, 128)         512
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 6, 6, 128)         147584
_________________________________________________________________
batch_normalization_5 (Batch (None, 6, 6, 128)         512
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 128)         0
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 3, 128)         0
_________________________________________________________________
flatten (Flatten)            (None, 1152)              0
_________________________________________________________________
dense (Dense)                (None, 1024)              1180672
_________________________________________________________________
dropout_3 (Dropout)          (None, 1024)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600
_________________________________________________________________
dropout_4 (Dropout)          (None, 1024)              0
_________________________________________________________________
dense_2 (Dense)              (None, 100)               102500
=================================================================
Total params: 2,579,484
Trainable params: 2,578,732
Non-trainable params: 752
_________________________________________________________________
